# Assignment #9 - Data Gathering and Warehousing - DSSA-5102

Instructor: Melissa Laurino</br>
Spring 2025</br>

Name: Joe D'Agostino
</br>
Date: 4/10/25
<br>
<br>
**At this time in the semester:** <br>
- We have explored a dataset. <br>
- We have cleaned our dataset. <br>
- We created a Github account with a repository for this class and included a metadata read me file about our data. <br>
- We introduced general SQL syntax, queries, and applications in Python.<br>
- Created our own databases from scratch using MySQL Workbench and Python with SQLAlchemy on our local server and locally on our machine.
- Populated our databases with the data we cleaned at the start of the semester.
<br>

At this point, we have discussed all major statements used with SQL, but the possibilities are endless when it comes to data! Below we will explore some miscellaneous statements and tools that may be useful with your database.<br>

<br>

Read Chapter 7 & 10 in Getting Started with SQL by Thomas Nield available on Blackboard. <br>
A quick reference for SQL commands: https://www.w3schools.com/sql/default.asp <br>

Review the powerpoint and other readings specified on Blackboard in the Discussion Board.<br>

In the event your database does not meet the requirements below to answer the question, please use the database provided in Assignment #4 and #5. Remember to credit your data source, especially when posting your assignments to Github.<br>

Feel free to use your preferred library and method for the exploration below. Now that all of our data is loaded onto the MySQL Workbench server, you can even take the assignment a step further and complete it all within SQL without Jupyter Notebook!<br>

Follow the instructions below to complete the assignment. Be sure to comment **all** code and answer **all** questions in markdown for full credit. Please submit this assignment with a link to it posted to your Github.<br>

**Data origin:** I'm using the usa_olympic_athletes_7_2 MySQL database I created in Assignment 7 using my [USA Olympic Athletes](https://github.com/joedag32/DSSA-5102_Spring2025/blob/main/README.md) dataset.

In [1]:
# Load necessary packages:
from sqlalchemy import create_engine, Column, String, Integer, Boolean, BigInteger, Float, text # Database navigation
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker
import mysql.connector
import pandas as pd # Python data manilpulation

In [2]:
#define mysql connection variables
conn = mysql.connector.connect(
        host="localhost", # This is my local instance number when you open MySQL Workbench.
        user="root", # This is my username for MySQL Workbench
        password="karateChop") # We wrote this password down in our first class!

# Create a cursor object using the cursor() method
cursor = conn.cursor()

In [3]:
# Time to connect to the database using SQL Alchemy:
DATABASE_URL = "mysql+mysqlconnector://root:karateChop@localhost/usa_olympic_athletes_7_2" # Use MySQL Connector to connect to the database
engine = create_engine(DATABASE_URL) # Creates a connection to the MySQL database

print("Connected to MySQL database successfully!")

Connected to MySQL database successfully!

#### CASE Statements
Case statements are similar to the if-then-else statements in programming. The data that meets the case statements in the database will be returned. You start a CASE statement with the word CASE and conclude it with an END. Between those keywords, you specify each condition with a WHEN [condition] THEN [value], where the condition and the values are specified by you.

Nield, Thomas. Getting Started with SQL (p. 71). O'Reilly Media. Kindle Edition. <br>
<br>
Write your question you are answering with your data query. <br>
<br>
**Example Question:** What age group are athletes in? 20s, 30s, etc.?
<br>
**What tables are we joining? (If any):** no, just using athlete

In [26]:
with engine.connect() as conn:
    # Select name and assign to age group Over 40 if the age is over 40, In their 30s in age is greater than or equal to 30, In their 20s
    # if age is greater than or equal to 30 and Teenager for any other age, from the athlete table and group by name and age_group
    case_1_query = text("""SELECT name,
                               CASE
                        		   WHEN age > 40 THEN 'Over 40'
                                   WHEN age >= 30 THEN 'In their 30s'
                                   WHEN age >= 20 THEN 'In their 20s'
                            	   ELSE 'Teenager'
                        	   END AS age_group
                           FROM athlete
                           GROUP BY name, age_group
                        """)
    case_1_query = pd.read_sql(case_1_query, conn) #Use pandas to read the sql query from the db

case_1_query.head() # Test the results

                   name     age_group
0       Per Knut Aaland  In their 30s
1          John Aalberg  In their 30s
2  Stephen Anthony Abas  In their 20s
3   David "Dave" Abbott  In their 20s
4         Jeremy Abbott  In their 20s

**CASE STATEMENT**
<br>
Write a second CASE statement!

Write your question you are answering with your data query. <br>
<br>
**Question:** What endorsement opportunities does an athlete probably get based on what medal they earned
<br>
**What tables are we joining? (If any):** athlete and medal

In [31]:
with engine.connect() as conn:
    # Select name, year and assign to endorsement if medal_name equals Gold, and to TV Commercial if medal_name equals Silver, and to
    # Local Library appearance for any other medal_name results from medal and inner join the athelte table with the medal table on the
    # matching medal_id columns where medal_name is not equal to 0 and randomly order the results
    case_2_query = text("""SELECT name, year,
                            	CASE
                            		WHEN medal.medal_name = 'Gold' THEN 'Wheaties box'
                                    WHEN medal.medal_name = 'Silver' THEN 'TV commercial'
                            		ELSE 'Local library appearance'
                            	END AS endorsement
                           FROM medal
                           INNER JOIN athlete ON medal.medal_id = athlete.medal_id
                           WHERE medal.medal_name != '0'
                           ORDER BY rand() -- make the order random
                        """)
    case_2_query = pd.read_sql(case_2_query, conn) #Use pandas to read the sql query from the db

case_2_query.head() # Test the results

                               name  year               endorsement
0      Theodore Joseph "Ted" McLear  1904             TV commercial
1     Ralph Patrick "Pat" McDonough  1984             TV commercial
2     James Sarsfield "Jim" Mitchel  1904  Local library appearance
3       Matthew John "Matt" McGrath  1912              Wheaties box
4  Deena Diane Deardurff (-Schmidt)  1972              Wheaties box

**CASE STATEMENT**
<br>
Write a third CASE statement!

Write your question you are answering with your data query. <br>
<br>
**Question:** Can we see an athlete and their sport and get a quick glimpse how tall they are relative to me.
<br>
**What tables are we joining? (If any):** sport and athlete

In [39]:
with engine.connect() as conn:
    # Select name, sport_name and set relative height to Taller than me if height is greater than 181 cm, My height if greater than 180 c,
    # and shorter than me for all else. From the sport table but join the athlete table where sport_id is equal in both tables and display
    # a random order
    case_3_query = text("""SELECT athlete.name, sport.sport_name,
                            	CASE
                            		WHEN athlete.height > 181 THEN 'Taller than me'
                                    WHEN athlete.height > 180 THEN 'My height'
                            		ELSE 'Shorter than me'
                            	END AS relative_height
                           FROM sport
                           INNER JOIN athlete ON sport.sport_id = athlete.sport_id
                           ORDER BY rand() -- make the order random
                        """)
    case_3_query = pd.read_sql(case_3_query, conn) #Use pandas to read the sql query from the db

case_3_query.head() # Test the results

                              name     sport_name  relative_height
0              Cullen Andrew Jones       Swimming   Taller than me
1  Kara Goucher (Grgas-, Wheeler-)      Athletics  Shorter than me
2                   John T. Watson           Golf  Shorter than me
3              Craig Ross Kressler  Speed Skating        My height
4    Mebrahtom R. "Meb" Keflezighi      Athletics  Shorter than me

**NULL**
<br>
As with all data, NULL values are fields with no data. Null data can be useful to know with the INSERT INTO statement below.

Find the NULL data within your database. Write your question you are answering with your data query. <br>
<br>
**Question:** Get all the rows where the weight or height value is NULL
<br>
**What tables are we joining? (If any):** athlete

In [28]:
with engine.connect() as conn:
    # Select all from athlete table where weight is NULL or height is NULL
    null_query = text("""SELECT *
                         FROM athlete 
                         WHERE weight IS NULL 
                         OR height IS NULL
                      """)
    null_query = pd.read_sql(null_query, conn) # Use pandas to read the sql query from the db

null_query.head() # Test the results

Empty DataFrame
Columns: [athlete_id, name, sex, age, height, weight, team, year, season, city, sport_id, event_id, medal_id]
Index: []

I don't have any NULL values in either of those columns due to clean up, but that would return rows if they were there.

**INSERT INTO**
<br>
You can insert new records into a table as needed using the INSERT INTO statement. If you choose to populate a table with certain records and not others, the rest of the fields will remain empty/NULL.
<br>
For INSERT INTO, we are not querying the database, instead we are ADDING to it. We do not need to use dbGetQuery(), but instead, dbExecute()!
<br><br>
**Objective:** Insert Olympic entries for me and Stacey into the athlete table
<br>
**What table(s) are we adding a record to?** athlete

In [29]:
with engine.connect() as conn:
    # Insert into athlete columns the values for Joe and Stacey. Notcie the sport_id, event_id, and medal_id values match the key values in 
    # their respective tables
    insert_query = text("""INSERT INTO athlete(name, sex, age, height, weight, team, year, season, city, sport_id, event_id, medal_id) 
                         VALUES 
                              ('Joe', 'M', 47.0, 177.8, 83.9, 'United States', 2024, 'Summer', 'Paris', 26, 65, 1), 
                              ('Stacey', 'F', 39.0, 147.3, 47.6, 'United States', 2024, 'Summer', 'Paris', 15, 617, 4);
                      """)
    # insert_query = pd.read_sql(insert_query, conn) # I don't want to run this one again, but I promise it does work!!

# insert_query.head() # Test the results

**MIN() and MAX()**
<br>
You can use these statements alone or in combination with the CASE statemts above.<br>
The IN operator in a WHERE clause lets you filter for multiple values at once. You can also exclude certain values by using the NOT IN operator.
<br>

**Question:** What were the heaviest and lightest athlete weights grouped by sport?
<br>
**What table(s) are we joining? (If any)** sport and athlete

In [30]:
with engine.connect() as conn:
    # Select the maximum weight value and assign it to heaviest, the minimum weight value and assign it to lightest and sport_name from
    # sport table and join it with the athlete table on matching sport_id columns where weight is greater than 0 and group by sport_name
    min_max_query = text("""SELECT MAX(weight) AS heaviest, MIN(weight) AS lightest, sport_name
                            FROM sport
                            INNER JOIN athlete ON sport.sport_id = athlete.sport_id
                            WHERE weight > 0 -- check to make sure a weight was recorded
                            GROUP BY sport_name
                      """)
    min_max_query = pd.read_sql(min_max_query, conn) # Use pandas to read the sql query from the db

min_max_query.head() # Test the results

   heaviest  lightest            sport_name
0      86.0      48.0  Cross Country Skiing
1     182.0      48.0             Wrestling
2     158.0      41.0             Athletics
3      86.0      36.0        Figure Skating
4     104.0      48.0               Cycling

Combine CASE statement with Min() and Max() for a more detailed query of your data:
<br><br>
**Question:** What is tallest male and female US Olympians by year.
<br>
**What table(s) are we joining?** no, just using athlete

In [32]:
with engine.connect() as conn:
    # Select the largest height value when sex equals F and assign it to max_female_height, if it's not F then set it to NULL. Select the
    # largeset height value when sex equals M and assign it to max_male_height, if it's not M then set it to NULL. Do them from the athelte
    # table and group by year and set the order of results randomly. I like this technique and could see it being used in many other cases!
    case_min_max_query = text("""SELECT year,
                                    	MAX(CASE WHEN sex = 'F' THEN height ELSE NULL END) as max_female_height,
                                        MAX(CASE WHEN sex = 'M' THEN height ELSE NULL END) as max_male_height
                                    FROM athlete
                                    GROUP BY year
                                    ORDER BY rand()
                              """)
    case_min_max_query = pd.read_sql(case_min_max_query, conn) # Use pandas to read the sql query from the db

case_min_max_query.head() # Test the results

   year  max_female_height  max_male_height
0  2000              201.0            207.0
1  1948              180.0            213.0
2  1912                NaN            195.0
3  1932              182.0            198.0
4  1998              180.0            195.0

**MIN() and MAX()** <br>
AVG() will take the average of a numeric field.

**Question:** What's the average female and male athlete age from 1900 to 2000?
<br>
**What table(s) are we joining?** no, just using athlete

In [33]:
with engine.connect() as conn:
    # Select year and calculate the average age value when the sex equals F and assign it to avg_female_age, otherwise set it to NULL. Do the
    # but when sex equals M and assign the results to avg_male_age from the athlete table where the year is between 1900 and 2000 and group
    # by year and order by year in descending order
    avg_min_max_query = text("""SELECT year,
                                	AVG(CASE WHEN sex = 'F' THEN age ELSE NULL END) as avg_female_age,
                                    AVG(CASE WHEN sex = 'M' THEN age ELSE NULL END) as avg_male_age
                                FROM athlete
                                WHERE year BETWEEN 1900 AND 2000
                                GROUP BY year
                                ORDER BY year DESC
                              """)
    avg_min_max_query = pd.read_sql(avg_min_max_query, conn) # Use pandas to read the sql query from the db

avg_min_max_query.head() # Test the results

   year  avg_female_age  avg_male_age
0  2000        26.17059      26.99528
1  1998        24.76984      25.91772
2  1996        25.83102      26.77615
3  1994        25.17978      25.00000
4  1992        24.92643      25.82363

Although this query gives us a quick answer, as a stand alone data frame, it is not that useful. We can add it to our longer query above. <br><br>
**Aliases (AS)**
<br>
You can abbreviate your code to make it more visually appealing...or more confusing? :) <br>
<br>
Examples:<br>
FROM table_name t<br>
FROM table_name AS t<br>
<br>
**Objective:** Use abbreviations or aliases for all tables for the same code you wrote above (If you have not done so already). Be sure to obtain the same result set.

In [34]:
with engine.connect() as conn:
    # Select name and year and create alias endorsement and assign it the value of Wheaties bos when medal_name equals Gold, TV Commercial
    # when medal_name equals Silver and Local Library appearance for any other value. Select this from table medal bus use the alias m
    # throughout the statement for that table and inner join with the athlete table with the alias of a throughout the statement and join
    # them when their respecitve medal_id columns are equal where the medal_name is not equal to 0 and randomly order the results
    aliases_query = text("""SELECT a.name, a.year,
                                	CASE
                                		WHEN m.medal_name = 'Gold' THEN 'Wheaties box'
                                        WHEN m.medal_name = 'Silver' THEN 'TV commercial'
                                		ELSE 'Local library appearance'
                                	END AS endorsement
                                FROM medal as m
                                INNER JOIN athlete AS a ON m.medal_id = a.medal_id
                                WHERE m.medal_name != '0'
                                ORDER BY rand()
                              """)
    aliases_query = pd.read_sql(aliases_query, conn) # Use pandas to read the sql query from the db

aliases_query.head() # Test the results

                                name  year    endorsement
0  Charles William "Charley" Paddock  1920   Wheaties box
1        Jessica Ann "Jessie" Vetter  2010  TV commercial
2         Colby Edmund "Babe" Slater  1920   Wheaties box
3    Mary Terstegge Meagher (-Plant)  1988  TV commercial
4                 Alonzo Carl Babers  1984   Wheaties box

I seem to not typically use abbrevations for tables, as I really hope I gave the tables clean names, but I'm sure working with larger datasets or databases I didn't create it would sure make things easier!

Now we are starting to create multiple new fields that we can save any time as a .csv if needed to access later. Save your result set as a .csv:

In [42]:
# Save result set as .csv file:
aliases_query.to_csv("endorsements.csv", index=False)

**DELETE** ~Caution!~
<br>
You can delete all records from specific tables or set a criteria to delete certain values or NULL values without deleting the table itself. It is okay if you do not execute the code if you have completed all data cleaning steps earlier in the semester.<br>
<br>
If you created autoincrement IDs for any of your data, it is recommended to use TRUNCATE TABLE instead, used the same way. The ID's will automatically reset if needed.<br>
<br>
**Objective:** Delete the records created for Joe and Stacey from the athlete table from this assignment.
<br>
**What table(s) are we deleting records from?** athlete

In [41]:
with engine.connect() as conn:
    # Delete from athlete the 2 entries I added earlier by their athlete_id. Our Olympic careers were brief but enjoyable.
    delete_query = text("""DELETE FROM athlete
                            WHERE athlete_id IN (37209, 37210)
                         """)
# commenting both of these out so I don't keep running them if I need to work a bit more above
#   connection.execute(delete_query)
#   connection.commit()

We can also delete entire tables in MySQL workbench by manually right clicking on the table and DROP TABLE. <br>
MySQL Workbench will prompt you to review the SQL syntax before dropping the table.<br>
The syntax is simple:<br>
DROP TABLE table_name<br>

In [ ]:
# Close the database connection!
conn.close()

**STOP**<br>
Before you submit, did you comment all your code?<br>
Did you answer all of the questions in the markdown cells?<br>
Did you rename the file and write your name at the top of the .pynb?<br>
Attach the .csv file you created with your Blackboard submission. It is preferred that you submit your Github link instead of the file itself.